# A Complete Guide to Pandas <img src="https://www.pinclipart.com/picdir/big/367-3678882_welding-logos-clip-art.png">

### Pandas is a fast, powerful, flexible and easy to use open source data analysis and manipulation tool, built on top of the Python programming language.
#### Pandas has Fast and efficient DataFrame object for Data Manipulation with integrated Indexing
##### Within Pandas we have series objects for each row and columns these are similar to numpy arrays
##### Pandas is build on numpy 
<img src= "https://www.w3resource.com/w3r_images/pandas-data-structure.svg">

# 1. Import Pandas as pd 
It is just a naming convention used by programmers

In [2]:
import pandas as pd

#  2. Pandas is all about working with dataframes 
### First we will learn how to create our own dataframe

In [47]:
df=pd.DataFrame({'colname1':[1,2,3],'colname2':[4,5,6]})
print(df)

   colname1  colname2
0         1         4
1         2         5
2         3         6

So What we did here is created to columns with names <b>colname1 and colname2</b> , we pass all the data  in form a <b>dictionary</b>.
Their are some <b>other methods</b> too to add data into  <b>Dataframe</b> we can <b>create series</b> outside and add it to our dataframe .

In [48]:
df['colname3'] = pd.Series([10,20,30])
print(df)

   colname1  colname2  colname3
0         1         4        10
1         2         5        20
2         3         6        30

let's see the tyes of everything saved in <b>python</b> using type function

In [49]:
type(df)

pandas.core.frame.DataFrame

In [50]:
type(df['colname1'])

pandas.core.series.Series

##### Their are 2 Ways to select a series from a DataFrame.
### df['colname'] or df.colname
<b>df.colname</b> has a limitation we can't use when their is space in between

In [51]:
df.colname1

0    1
1    2
2    3
Name: colname1, dtype: int64

In [52]:
df['colname1']

0    1
1    2
2    3
Name: colname1, dtype: int64

#### Rename columns in a Pandas DataFrame
#### we have various methods to change column name
1. use rename method:
    <b>df.rename(columns = { 'colname1':'col1'},inplace=True)</b>
##### Rename method has argument inplace we use it for changing the actual element otherwise pandas just apply this change temporary

In [53]:
df.rename(columns = { 'colname1':'col1'},inplace=True)
print(df)

   col1  colname2  colname3
0     1         4        10
1     2         5        20
2     3         6        30

2. Use new names:<br>
    <b>df.new_col_name = ['col1','col2','col3']</b>
    <b>df.columns = df.new_col_name</b>

In [54]:
df.new_col_name = ['col1','col2','col3']
df.columns = df.new_col_name
print(df)

   col1  col2  col3
0     1     4    10
1     2     5    20
2     3     6    30

C:\Users\rockl\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  """Entry point for launching an IPython kernel.

3. Change name while reading filles:<br>
    <b>pd.read_csv('abc.csv',names = ['col1','col2','col3'])</b>

In [55]:
pd.read_csv('abc.csv',names = ['col1','col2','col3'])

   col1  col2  col3
0     1     4    10
1     2     5    20
2     3     6    30

#### Removing columns from DataFrame using drop method
1. Removing 1 column
<b>df.drop('colname',axis= 0 or 1 ,inplace = True)</b><br>
axis= 0 for row axis<br>
axis= 1 for column axis

In [56]:
df.drop('col1',inplace = True,axis=1)

In [57]:
print(df)

   col2  col3
0     4    10
1     5    20
2     6    30

2. Removing muliple columns by passing list<br>
<b>df.drop(['col2','col3'],axis= 0 or 1 ,inplace = True)</b><br>

In [58]:
df.drop(['col2','col3'],axis= 0 or 1 ,inplace = True)

In [59]:
df

Empty DataFrame
Columns: []
Index: [0, 1, 2]

In [60]:
df=pd.DataFrame({'colname1':[1,2,3],'colname2':[4,5,6],'colname3':[7,8,9]})

3. By changing axis to 0 we can delete rows too<br>
<b>df.drop([1], axis=0 ,inplace = True) in colname we pass index of row</b>

In [64]:
df.drop([1], axis=0 ,inplace = True)

In [65]:
df

   colname1  colname2  colname3
0         1         4         7
2         3         6         9

#### Import only few columns and rows

In [32]:
df1 =pd.read_csv('abc.csv',usecols=[1,2],names=['col1','col2'])

In [33]:
df1

   col1  col2
0     1     4
1     2     5
2     3     6

In [34]:
df2 =pd.read_csv('abc.csv',nrows=2 ,names=['col1','col2','col3'])

In [35]:
df2

   col1  col2  col3
0     1     4    10
1     2     5    20

# Let's work on some real data now.
## We are working on drinks dataset

In [44]:
drinks = pd.read_csv('http://bit.ly/drinksbycountry', index_col='country')

In [45]:
drinks.head()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
country,,,,,
Afghanistan,0,0,0,0.0,Asia
Albania,89,132,54,4.9,Europe
Algeria,25,0,14,0.7,Africa
Andorra,245,138,312,12.4,Europe
Angola,217,57,45,5.9,Africa

# Apply string operations on DataFrame

In [55]:
drinks.dtypes

beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object